index-0/libfe310/inc/fe310/periph/hw/pwm.h
/* See LICENSE file for copyright and license details. */

#ifndef LIBFE310_PERIPH_HW_PWM_H
#define LIBFE310_PERIPH_HW_PWM_H

#include <fe310/bits.h>

#define PWM0_BASE 0x10015000
#define PWM1_BASE 0x10025000
#define PWM2_BASE 0x10035000

#define PWM_CFG_SCALE GENMASK(3, 0)
#define PWM_CFG_STICKY BITMASK(8)
#define PWM_CFG_ZEROCMP BITMASK(9)
#define PWM_CFG_DEGLITCH BITMASK(10)
#define PWM_CFG_ENALWAYS BITMASK(12)
#define PWM_CFG_ENONESHOT BITMASK(13)
#define PWM_CFG_CMPnCENTER GENMASK(19, 16)
#define PWM_CFG_CMP0CENTER BITMASK(16)
#define PWM_CFG_CMP1CENTER BITMASK(17)
#define PWM_CFG_CMP2CENTER BITMASK(18)
#define PWM_CFG_CMP3CENTER BITMASK(19)
#define PWM_CFG_CMPnGANG GENMASK(27, 24)
#define PWM_CFG_CMP0GANG BITMASK(24)
#define PWM_CFG_CMP1GANG BITMASK(25)
#define PWM_CFG_CMP2GANG BITMASK(26)
#define PWM_CFG_CMP3GANG BITMASK(27)
#define PWM_CFG_CMPnIP GENMASK(31, 28)
#define PWM_CFG_CMP0IP BITMASK(28)
#define PWM_CFG_CMP1IP BITMASK(29)
#define PWM_CFG_CMP2IP BITMASK(30)
#define PWM_CFG_CMP3IP BITMASK(31)
/* #define PWM_COUNT */
/* #define PWM_S */
/* #define PWM_CMP */

#define GPIO_PWM0_PWM0 BITMASK(0)
#define GPIO_PWM0_PWM1 BITMASK(1)
#define GPIO_PWM0_PWM2 BITMASK(2)
#define GPIO_PWM0_PWM3 BITMASK(3)
#define GPIO_PWM1_PWM0 BITMASK(20)
#define GPIO_PWM1_PWM1 BITMASK(19)
#define GPIO_PWM1_PWM2 BITMASK(21)
#define GPIO_PWM1_PWM3 BITMASK(22)
#define GPIO_PWM2_PWM0 BITMASK(10)
#define GPIO_PWM2_PWM1 BITMASK(11)
#define GPIO_PWM2_PWM2 BITMASK(12)
#define GPIO_PWM2_PWM3 BITMASK(13)

#endif /* LIBFE310_PERIPH_HW_PWM_H */
